#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
google_compute_instance.server02: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server02]
google_compute_instance.server03: Refreshing state... [id=projects/iac-trabalho-1/zones/us-central1-c/instances/server03]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.server02 must be replaced
-/+ resource "google_compute_instance" "server02" {
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/iac-trabalho-1/zones/us-central1-c/instances/server02" -> (known after apply)
      ~ instance_id             = "3090288518083696279" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {
          - "ssh-keys" = <<-EOT
                juliavit1999:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBGHsMfCOARG96ITGU3wMpSCOBmTxWBl+QnK37L69TMeA31ZYxNuBiwCZp6e5AWz+6m1xMKlXaFnmYqQ7EqGSi/s= google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-16T22:51:10+0000"}
                juliavit1999:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCYqj/bxjWcAvc3FvrXry9fQArnibke426DPeuBy4m4vbzUutTvC5stV6aX/UdASAktogWxyPqbCQKz/bewPy9uYVr1KHDv/lj/aCiJLXegzZcAsEk22OB5Z68X3kypod25MPUlBXKa0IMegHO6gQejEfI0BhsGXzNzedB5P2myvut3S+Z9WKRXZEvuBY1zPwU3bAuWextfoNKU81r+zJJzB8KiG7Bdulmj+RBs5Auqyasp1oRoONhL0RGIRF0xu6vbqdaBICm3bp4JHidngQic22dDeMPxf4pO37Q4XBheXt0GSmXNM+CLATdXBoYBXtEgRXHx8T5hfqomfff+vgyv google-ssh {"userName":"juliavit1999@gmail.com","expireOn":"2022-11-16T22:51:15+0000"}
            EOT
        } -> null
      ~ metadata_fingerprint    = "sObrO1_mth4=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            #!/bin/bash
          - sudo apt update && sudo apt upgrade
          + # Update packages and Upgrade system
          + sudo apt-get update -y && sudo apt-get upgrade -y
            
          - # Install Apache2
          - sudo apt -y install apache2
          + ## Install AMP
          + sudo apt-get install apache2 apache2-doc apache2-mpm-prefork apache2-utils libexpat1 ssl-cert -y
            
          - # Install MySql
          - sudo apt install mysql-server
          + sudo apt-get install libapache2-mod-php5 php5 php5-common php5-curl php5-dev php5-gd php5-idn php-pear php5-imagick php5-mcrypt php5-mysql php5-ps php5-pspell php5-recode php5-xsl -y
            
          - # Install PHP
          - sudo apt install software-properties-common ca-certificates lsb-release apt-transport-https 
          + sudo apt-get install mysql-server mysql-client libmysqlclient15.dev -y
            
          - LC_ALL=C.UTF-8 add-apt-repository ppa:ondrej/php 
          - sudo apt update 
          - sudo apt install php8.1 
          - sudo apt install php8.1-mysql php8.1-mbstring php8.1-xml php8.1-curl
          + sudo apt-get install phpmyadmin -y
          + 
          + sudo apt-get install apache2 libapache2-mod-php5 php5 mysql-server php-pear php5-mysql mysql-client mysql-server php5-mysql php5-gd -y
          + 
          + sudo chown -R www-data:www-data /var/www
          + 
          + sudo a2enmod rewrite
          + sudo php5enmod mcrypt
          + 
          + # Restart Apache
          + sudo service apache2 restart
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "server02"
      ~ project                 = "iac-trabalho-1" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/instances/server02" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "us-central1-c" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/zones/us-central1-c/disks/server02" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20221018" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/global/networks/default" -> "default"
          ~ network_ip         = "10.128.0.10" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/iac-trabalho-1/regions/us-central1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "iac-trabalho-1" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.68.90.76" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `gcp/main-infrastructure/`, Workflow: `GCP - Create terraform plan for Main Infrastructure`*